//6) Напишите программу, выписывающую все элементы последовательности, имеющие не менее пяти делителей

#include <iostream>

using namespace std;
/*
int del(int a){
int h = 0;
for(int i = 0; i < a; i++){
    if((a % (a - i)) == 0){
        h++;
    }
}return h;
};

int main(){
    int N; cin >> N;

int A[N];
for (int i = 0; i < N; i++){
    cin >> A[i];
}
for (int i = 0; i < N; i++){
        if(del(A[i]) >= 5){
            cout << A[i] << " ";
        }
  }
return 0;

}*/



