/*19) √оночна€ трасса состоит из двух основных дорог и нескольких переездов,
позвол€ющих перейти с одной дороги на другую. Ќа всех участках, включа€
переезды, движение разрешено только в одну сторону, поэтому переезд возможен
только с дороги A на дорогу B. √онщик стартует в точке A0 и должен финишировать
в точке BN. ќн знает, за какое врем€ сможет пройти каждый участок пути по каждой
дороге, то есть врем€ прохождени€ участков A0A1, A1A2, Е, AN-1AN, B0B1, B1B2, Е,
BN-1BN. ¬рем€ прохождени€ всех переездов A0B0, A1B1, Е, ANBN одинаково и
известно гонщику. Ќеобходимо определить, за какое минимальное врем€ гонщик
сможет пройти трассу.
¬ходные данные
¬ первой строке задаЄтс€ количество участков трассы N. ¬о второй строке
задаЄтс€ целое число t Ч врем€ (в секундах) прохождени€ каждого из переездов
A0B0, A1B1, Е, ANBN. ¬ каждой из последующих N строк записано два целых числа
ai и bi
, задающих врем€ (в секундах) прохождени€ очередного участка на каждой из
дорог. ¬ первой из этих строк указываетс€ врем€ прохождени€ участков A0A1 и
B0B1, во второй Ч A1A2 и B1B2 и т. д.
¬ыходные данные
ѕрограмма должна напечатать одно целое число: минимально возможное врем€
прохождени€ трассы (в секундах).
*/
